app/controllers/equipments_controller.rb

  def index
    equipments = Equipment.all
---
SELECT "equipment".* FROM "equipment"