app/controllers/equipments_controller.rb

  def shields
    shields = Equipment.where(equipment_type: 'Shield')
---
SELECT "equipment".* FROM "equipment" WHERE "equipment"."equipment_type" = ?  [["equipment_type", "Shield"]]

  def weapons
    weapons = Equipment.where(equipment_type: 'Weapon')
---
SELECT "equipment".* FROM "equipment" WHERE "equipment"."equipment_type" = ?  [["equipment_type", "Weapon"]]

  def armors
    armors = Equipment.where(equipment_type: 'Armor')
---
SELECT "equipment".* FROM "equipment" WHERE "equipment"."equipment_type" = ?  [["equipment_type", "Armor"]]

  def create
    equipment = Equipment.new(equipment_params)

    if equipment.save
---
INSERT INTO "equipment" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Shields"], ["created_at", "2024-09-12 02:47:35.335645"], ["updated_at", "2024-09-12 02:47:35.335645"]]

  def destroy
    @equipment.destroy!
---
DELETE FROM "equipment" WHERE "equipment"."id" = ?  [["id", 2]]

  def set_equipment
    @equipment = Equipment.find(params[:id])
---
SELECT "equipment".* FROM "equipment" WHERE "equipment"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]